import About from '@/pages/About';
import tabs from '@/types/tabs'
import Layout from '@/layouts//Layout';
const page = () => {
  let arr:number[] = [2019,2020,2021,2022,2023,2024];
  let tabs:tabs[] = [
    { 
      img1:'/foto.svg',
      text1:'В результаті жодного місця. Але досвід колосальний.',
      img2:'/foto1.png',
      text2:'Хочу сказати одну річ. Якщо у вас РХП і ви в ремісії, навіть не думайте про ці змагання. Просто ви не зможете! Не руйнуйте себе ще більше. Продовжуйте жити і радіти ремісії РХП. Це окрема історія про яку я обовзяково розкажу в подробицях.'
      
    },
    { 
      img1:'/1.png',
      text1:'2023',
      img2:'/1.png',
      text2:'Хочу сказати одну річ. Якщо у вас РХП і ви в ремісії, навіть не думайте про ці змагання. Просто ви не зможете! Не руйнуйте себе ще більше. Продовжуйте жити і радіти ремісії РХП. Це окрема історія про яку я обовзяково розкажу в подробицях.'
      
    },
    { 
      img1:'/2.png',
      text1:'2022',
      img2:'/2.png',
      text2:'Хочу сказати одну річ. Якщо у вас РХП і ви в ремісії, навіть не думайте про ці змагання. Просто ви не зможете! Не руйнуйте себе ще більше. Продовжуйте жити і радіти ремісії РХП. Це окрема історія про яку я обовзяково розкажу в подробицях.'
      
    },
    { 
      img1:'/3.png',
      text1:'2021',
      img2:'/3.png',
      text2:'Хочу сказати одну річ. Якщо у вас РХП і ви в ремісії, навіть не думайте про ці змагання. Просто ви не зможете! Не руйнуйте себе ще більше. Продовжуйте жити і радіти ремісії РХП. Це окрема історія про яку я обовзяково розкажу в подробицях.'
      
    }
    ,
    { 
      img1:'/4.png',
      text1:'2020',
      img2:'/4.png',
      text2:'Хочу сказати одну річ. Якщо у вас РХП і ви в ремісії, навіть не думайте про ці змагання. Просто ви не зможете! Не руйнуйте себе ще більше. Продовжуйте жити і радіти ремісії РХП. Це окрема історія про яку я обовзяково розкажу в подробицях.'
      
    },
    { 
      img1:'/image.svg',
      text1:'2019',
      img2:'/image.svg',
      text2:'Хочу сказати одну річ. Якщо у вас РХП і ви в ремісії, навіть не думайте про ці змагання. Просто ви не зможете! Не руйнуйте себе ще більше. Продовжуйте жити і радіти ремісії РХП. Це окрема історія про яку я обовзяково розкажу в подробицях.'
      
    }
  ].reverse();
  return (<>
  <Layout>
    <main className='bg-bg1'>
      <About arr={arr} tabs={tabs} />
    </main>
    </Layout>
    </>
  )
}

export default page
